config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: Lourenço Henrique Moinheiro Martins Sborz Bogo
#+PROPERTY: header-args :tangle yes

* User
#+begin_src emacs-lisp
(setq user-full-name "Lourenço Bogo"
      user-mail-address "louhmmsb@hotmail.com")
#+end_src
* Visuals
** Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-horizon)
#+end_src
** Font
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Fira Code" :size 15 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Fira Code" :size 15))
#+end_src
** Line Numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src
** Screen
#+begin_src emacs-lisp
(if (eq initial-window-system 'x) ;if started by emacs command or desktop
    (toggle-frame-maximized)
  (toggle-frame-fullscreen))
#+end_src
* Programming
** Org-Mode
Bullet Mode
#+begin_src emacs-lisp
(use-package! org-bullets
  :hook (org-mode . org-bullets-mode))
#+end_src
Org directory
#+begin_src emacs-lisp
(setq org-directory "~/org")
#+end_src
